@justinretzolk Hey! I running into the same issue, can provide inputs for this task.

### Terraform destroy & Terraform apply
```zsh
(research_kedro_microservice) ➜  aws_batch git:(iss-3-aws-infrastructure) ✗ make destroy
terraform destroy
aws_iam_role.ecs_instance_role: Refreshing state... [id=test-research-kedro-microservice-aws-iam-role]
aws_iam_role_policy_attachment.ecs_instance_role: Refreshing state... [id=test-research-kedro-microservice-aws-iam-role-20220614120738864000000001]
aws_iam_instance_profile.ecs_instance_role: Refreshing state... [id=test-research-kedro-microservice-aws-iam-instance-profile]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # aws_iam_role.ecs_instance_role has been changed
  ~ resource "aws_iam_role" "ecs_instance_role" {
        id                    = "test-research-kedro-microservice-aws-iam-role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role",
        ]
        name                  = "test-research-kedro-microservice-aws-iam-role"
        tags                  = {
            "environment"  = "test"
            "project_name" = "research-kedro-microservice"
            "region"       = "us-east-2"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # aws_iam_instance_profile.ecs_instance_role will be destroyed
  - resource "aws_iam_instance_profile" "ecs_instance_role" {
      - arn         = "arn:aws:iam::946627858531:instance-profile/test-research-kedro-microservice-aws-iam-instance-profile" -> null
      - create_date = "2022-06-14T12:07:38Z" -> null
      - id          = "test-research-kedro-microservice-aws-iam-instance-profile" -> null
      - name        = "test-research-kedro-microservice-aws-iam-instance-profile" -> null
      - path        = "/" -> null
      - role        = "test-research-kedro-microservice-aws-iam-role" -> null
      - tags        = {
          - "environment"  = "test"
          - "project_name" = "research-kedro-microservice"
          - "region"       = "us-east-2"
        } -> null
      - tags_all    = {
          - "environment"  = "test"
          - "project_name" = "research-kedro-microservice"
          - "region"       = "us-east-2"
        } -> null
      - unique_id   = "AIPA5YZ3K2BR6ZSWECQDF" -> null
    }

  # aws_iam_role.ecs_instance_role will be destroyed
  - resource "aws_iam_role" "ecs_instance_role" {
      - arn                   = "arn:aws:iam::946627858531:role/test-research-kedro-microservice-aws-iam-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-06-14T12:07:37Z" -> null
      - force_detach_policies = false -> null
      - id                    = "test-research-kedro-microservice-aws-iam-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "test-research-kedro-microservice-aws-iam-role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "environment"  = "test"
          - "project_name" = "research-kedro-microservice"
          - "region"       = "us-east-2"
        } -> null
      - tags_all              = {
          - "environment"  = "test"
          - "project_name" = "research-kedro-microservice"
          - "region"       = "us-east-2"
        } -> null
      - unique_id             = "AROA5YZ3K2BR45A6YXLU6" -> null

      - inline_policy {}
    }

  # aws_iam_role_policy_attachment.ecs_instance_role will be destroyed
  - resource "aws_iam_role_policy_attachment" "ecs_instance_role" {
      - id         = "test-research-kedro-microservice-aws-iam-role-20220614120738864000000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role" -> null
      - role       = "test-research-kedro-microservice-aws-iam-role" -> null
    }

Plan: 0 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  - aws_batch_env_subnets_ids = [
      - "subnet-0ffc295914ee8f62e",
      - "subnet-0644a889bb64f3e2c",
    ] -> null
  - aws_batch_subnets_ids     = [
      - "subnet-0ffc295914ee8f62e",
      - "subnet-0644a889bb64f3e2c",
      - "subnet-018a09b8964cddeb1",
      - "subnet-0c9ffb7ee119d4539",
      - "subnet-050fde753140abc0b",
      - "subnet-04d08097f9b5e19a7",
    ] -> null
  - ce_instance_type          = [
      - "c5a.large",
      - "c5a.xlarge",
    ] -> null
  - docker_image_id           = "946627858531.dkr.ecr.us-east-2.amazonaws.com/research-kedro-microservice:latest" -> null
  - ecr_repository_url        = "946627858531.dkr.ecr.us-east-2.amazonaws.com/research-kedro-microservice" -> null
  - env                       = "test" -> null
  - project_name              = "research-kedro-microservice" -> null

Do you really want to destroy all resources in workspace "test"?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

aws_iam_role_policy_attachment.ecs_instance_role: Destroying... [id=test-research-kedro-microservice-aws-iam-role-20220614120738864000000001]
aws_iam_instance_profile.ecs_instance_role: Destroying... [id=test-research-kedro-microservice-aws-iam-instance-profile]
aws_iam_role_policy_attachment.ecs_instance_role: Destruction complete after 1s
aws_iam_instance_profile.ecs_instance_role: Destruction complete after 1s
aws_iam_role.ecs_instance_role: Destroying... [id=test-research-kedro-microservice-aws-iam-role]
aws_iam_role.ecs_instance_role: Destruction complete after 1s

Destroy complete! Resources: 3 destroyed.
(research_kedro_microservice) ➜  aws_batch git:(iss-3-aws-infrastructure) ✗ make apply 
terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_batch_compute_environment.aws_batch_ce will be created
  + resource "aws_batch_compute_environment" "aws_batch_ce" {
      + arn                             = (known after apply)
      + compute_environment_name        = "test-research-kedro-microservice-batch-ce"
      + compute_environment_name_prefix = (known after apply)
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = (known after apply)
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags                            = {
          + "environment"  = "test"
          + "project_name" = "research-kedro-microservice"
          + "region"       = "us-east-2"
        }
      + tags_all                        = {
          + "environment"  = "test"
          + "project_name" = "research-kedro-microservice"
          + "region"       = "us-east-2"
        }
      + type                            = "MANAGED"

      + compute_resources {
          + desired_vcpus      = (known after apply)
          + ec2_key_pair       = "aws-us-east-2"
          + instance_role      = (known after apply)
          + instance_type      = [
              + "c5a.large",
              + "c5a.xlarge",
            ]
          + max_vcpus          = 16
          + min_vcpus          = 2
          + security_group_ids = [
              + "sg-0982f0b060b95781a",
            ]
          + subnets            = [
              + "subnet-0644a889bb64f3e2c",
              + "subnet-0ffc295914ee8f62e",
            ]
          + tags               = {
              + "environment"  = "test"
              + "project_name" = "research-kedro-microservice"
              + "region"       = "us-east-2"
            }
          + type               = "SPOT"

          + ec2_configuration {
              + image_id_override = (known after apply)
              + image_type        = (known after apply)
            }
        }
    }

  # aws_iam_instance_profile.ecs_instance_role will be created
  + resource "aws_iam_instance_profile" "ecs_instance_role" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "test-research-kedro-microservice-aws-iam-instance-profile"
      + path        = "/"
      + role        = "test-research-kedro-microservice-aws-iam-role"
      + tags        = {
          + "environment"  = "test"
          + "project_name" = "research-kedro-microservice"
          + "region"       = "us-east-2"
        }
      + tags_all    = {
          + "environment"  = "test"
          + "project_name" = "research-kedro-microservice"
          + "region"       = "us-east-2"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.aws_batch_service_role will be created
  + resource "aws_iam_role" "aws_batch_service_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "batch.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test-research-kedro-microservice-aws-iam-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment"  = "test"
          + "project_name" = "research-kedro-microservice"
          + "region"       = "us-east-2"
        }
      + tags_all              = {
          + "environment"  = "test"
          + "project_name" = "research-kedro-microservice"
          + "region"       = "us-east-2"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_instance_role will be created
  + resource "aws_iam_role" "ecs_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test-research-kedro-microservice-aws-iam-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment"  = "test"
          + "project_name" = "research-kedro-microservice"
          + "region"       = "us-east-2"
        }
      + tags_all              = {
          + "environment"  = "test"
          + "project_name" = "research-kedro-microservice"
          + "region"       = "us-east-2"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.aws_batch_service_role will be created
  + resource "aws_iam_role_policy_attachment" "aws_batch_service_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"
      + role       = "test-research-kedro-microservice-aws-iam-role"
    }

  # aws_iam_role_policy_attachment.ecs_instance_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_instance_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "test-research-kedro-microservice-aws-iam-role"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_batch_env_subnets_ids = [
      + "subnet-0ffc295914ee8f62e",
      + "subnet-0644a889bb64f3e2c",
    ]
  + aws_batch_subnets_ids     = [
      + "subnet-0ffc295914ee8f62e",
      + "subnet-0644a889bb64f3e2c",
      + "subnet-018a09b8964cddeb1",
      + "subnet-0c9ffb7ee119d4539",
      + "subnet-050fde753140abc0b",
      + "subnet-04d08097f9b5e19a7",
    ]
  + ce_instance_type          = [
      + "c5a.large",
      + "c5a.xlarge",
    ]
  + docker_image_id           = "946627858531.dkr.ecr.us-east-2.amazonaws.com/research-kedro-microservice:latest"
  + ecr_repository_url        = "946627858531.dkr.ecr.us-east-2.amazonaws.com/research-kedro-microservice"
  + env                       = "test"
  + project_name              = "research-kedro-microservice"
aws_iam_role.ecs_instance_role: Creating...
aws_iam_role.aws_batch_service_role: Creating...
aws_iam_role.aws_batch_service_role: Creation complete after 1s [id=test-research-kedro-microservice-aws-iam-role]
aws_iam_role_policy_attachment.aws_batch_service_role: Creating...
aws_iam_role_policy_attachment.aws_batch_service_role: Creation complete after 1s [id=test-research-kedro-microservice-aws-iam-role-20220614121327577500000001]
╷
│ Error: failed creating IAM Role (test-research-kedro-microservice-aws-iam-role): EntityAlreadyExists: Role with name test-research-kedro-microservice-aws-iam-role already exists.
│       status code: 409, request id: 7f006469-b72a-4c32-8355-298c2df936c6
│ 
│   with aws_iam_role.ecs_instance_role,
│   on security.tf line 1, in resource "aws_iam_role" "ecs_instance_role":
│    1: resource "aws_iam_role" "ecs_instance_role" {
│ 
╵
make: *** [Makefile:8: apply] Error 1
(research_kedro_microservice) ➜  aws_batch git:(iss-3-aws-infrastructure) ✗ 
```

### Terraform code I use

```terraform
resource "aws_iam_role" "ecs_instance_role" {
  name = "${local.env}-${local.project_name}-aws-iam-role"

  assume_role_policy = <<EOF
{
    "Version": "2012-10-17",
    "Statement": [
    {
        "Action": "sts:AssumeRole",
        "Effect": "Allow",
        "Principal": {
            "Service": "ec2.amazonaws.com"
        }
    }
    ]
}
EOF

  tags = merge(
    local.vpc_tags,
    {environment = terraform.workspace}
  )
}

resource "aws_iam_role_policy_attachment" "ecs_instance_role" {
  role       = aws_iam_role.ecs_instance_role.name
  policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
}

resource "aws_iam_instance_profile" "ecs_instance_role" {
  
  name = "${local.env}-${local.project_name}-aws-iam-instance-profile"
  role = aws_iam_role.ecs_instance_role.name

  tags = merge(
    local.vpc_tags,
    {environment = terraform.workspace}
  )
}

resource "aws_iam_role" "aws_batch_service_role" {
  name = "${local.env}-${local.project_name}-aws-iam-role"

  assume_role_policy = <<EOF
{
    "Version": "2012-10-17",
    "Statement": [
    {
        "Action": "sts:AssumeRole",
        "Effect": "Allow",
        "Principal": {
        "Service": "batch.amazonaws.com"
        }
    }
    ]
}
EOF

  tags = merge(
    local.vpc_tags,
    {environment = terraform.workspace}
  )
}

resource "aws_iam_role_policy_attachment" "aws_batch_service_role" {
  role       = aws_iam_role.aws_batch_service_role.name
  policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"
}

```